tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
brew 'git'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'pigz'
brew 'imagemagick'
brew 'mas' # Mac App Store manager
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'
brew 'nvm'
brew 'deno'
brew 'telnet'
brew 'wget'
brew 'zsh'
brew 'speedtest-cli'
brew 'tree'
brew 'htop'
brew 'archey'
brew 'jq'
brew 'task'
brew 'tmux'
brew 'nvim'
brew 'starship'

cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'
cask 'slack'
cask 'visual-studio-code'
cask 'adoptopenjdk8'
cask 'iterm2'

brew 'jenkins-lts'
brew 'openshift-cli'
brew 'source-to-image'

cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-terminus'
cask 'font-hack-nerd-font'

tap 'epk/epk'
cask 'font-sf-mono-nerd-font'

tap 'koekeishiya/formulae'
brew 'yabai'
brew 'skhd'
